In [8]:
import pandas as pd

sl = pd.Series({
    '김' : 100,
    '나' : 141,
    '박' : 129,
    '이' : 124
})
sl.name = '수학'

print(sl)

s2 = pd.Series({
    '김' : 30,
    '나' : 5,
    '박' : 12339,
    '이' : 141
})

print(s2)

s3 = pd.Series([8, 3, 13, 2])
s3.name = '국어'
print(s3)

s4 = pd.Series([30, 5, 13, 2])
print(s4)

김    100
나    141
박    129
이    124
Name: 수학, dtype: int64
김       30
나        5
박    12339
이      141
dtype: int64
0     8
1     3
2    13
3     2
Name: 국어, dtype: int64
0    30
1     5
2    13
3     2
dtype: int64

# 데이터 프레임

In [10]:
df = pd.DataFrame({
    '출생지' : ['한국', '미국'],
    '나이' : [20, 30]
})

print(df)

df

  출생지  나이
0  한국  20
1  미국  30

  출생지  나이
0  한국  20
1  미국  30

In [12]:
df['성별'] = ['여', '남']

df

  출생지  나이 성별
0  한국  20  여
1  미국  30  남

In [14]:
df.loc[3] = ['일본', 25, '여']

df

  출생지  나이 성별
0  한국  20  여
1  미국  30  남
2  일본  25  여
3  일본  25  여

In [18]:
df2 = pd.DataFrame(sl)
df2['영어'] = s2
df2['미술'] = [1,2,3,4]

df2

    수학     영어  미술
김  100     30   1
나  141      5   2
박  129  12339   3
이  124    141   4

In [19]:
df2[['미술']]

   미술
김   1
나   2
박   3
이   4

In [21]:
df2.loc[['김']]

    수학  영어  미술
김  100  30   1

In [26]:
df2.loc[['김'],['미술']]

   미술
김   1

In [27]:
df2

    수학     영어  미술
김  100     30   1
나  141      5   2
박  129  12339   3
이  124    141   4

In [28]:
df2.sum()

수학      494
영어    12515
미술       10
dtype: int64

In [33]:
df2.mean(axis=1)

김      43.666667
나      49.333333
박    4157.000000
이      89.666667
dtype: float64

In [30]:
df2['수학'].mean()

123.5

# 미션1

In [ ]:
# df2.loc[조건, 열이름]